[
{"Image": "https://hibiscus.services/home-asset/joshita.jpg", "Name": "Joshita Posani", "Designation": "Fullstack Developer I", "Introduction": "As a Full Stack Developer at Hibiscus, I have been given the opportunity to work on a variety of challenging projects that have allowed me to expand my skills and knowledge significantly.I've also honed my expertise in various other areas, such as understanding and implementing software solutions, problem-solving, and working collaboratively within a team environment. What makes Hibiscus stand out is the team and the projects we work on. The work environment here is collaborative, supportive, and encourages learning at every step. The projects are diverse and challenging, pushing us to continuously evolve and adapt to new technologies and methodologies. The supportive team and the chance to work on interesting projects make every day at Hibiscus a rewarding experience", "Screenshot": "screenshots/testimonial_1.png"},
{"Image": "https://hibiscus.services/home-asset/teja.jpg", "Name": "Satyavada Hema Sai Teja", "Designation": "Full Stack Developer II", "Introduction": "My role as a Full Stack Developer II in Cloud Computing has been both fulfilling and enriching. What I enjoy most about working at Hibiscus is the vibrant community and the opportunity to contribute to meaningful projects that truly make a difference. Through my journey here, I've honed my leadership abilities, fostered collaboration, and delved into exciting coding challenges. To anyone considering joining Hibiscus, my advice is simple: embrace every opportunity to learn and grow.", "Screenshot": "screenshots/testimonial_2.png"},
{"Image": "https://hibiscus.services/home-asset/rohit.jpg", "Name": "Rohit Saini", "Designation": "Developer II", "Introduction": "As a Developer II at Hibiscus, I've had the privilege of contributing to a diverse range of projects that have not only broadened my technical expertise but also deepened my understanding of software development. Through these projects, I've refined my skills in software solution implementation, problem-solving, and collaborative teamwork. What sets Hibiscus apart is its exceptional team and the variety of projects we undertake. The collaborative and supportive work environment fosters continuous learning, and the diverse projects we work on challenge us to stay at the forefront of technological advancements. The combination of a supportive team and the opportunity to work on engaging projects makes every day at Hibiscus a fulfilling experience.", "Screenshot": "screenshots/testimonial_3.png"},
{"Image": "https://hibiscus.services/home-asset/laxmi.jpg", "Name": "Lakshmi Susreetha D", "Designation": "ML/AI Developer", "Introduction": "I'm an ML/AI Developer at Hibiscus, exploring into innovative tasks that drive cutting-edge solutions. The dynamic environment nurtures growth in problem-solving and teamwork, creating a fulfilling work experience. Over time, I've honed my skills in AI/ML technologies, emphasizing impactful solutions and consistent high-quality work. To those considering joining Hibiscus, my advice is to embrace challenges with dedication; it's a place where commitment leads to a rewarding journey of personal and professional growth and development.", "Screenshot": "screenshots/testimonial_4.png"},
{"Image": "https://hibiscus.services/home-asset/madan.jpg", "Name": "V K Madhan", "Designation": "Developer I", "Introduction": "As a Developer I at Hibiscus, I’ve found my journey to be incredibly rewarding. The collaborative environment here is something I truly enjoy. Working with talented and supportive colleagues has not only made my daily work enjoyable but also helped me grow professionally. I’ve honed my technical skills, particularly in Python and Cloud Platforms, and have gained valuable insights into the industry. For anyone interested in joining Hibiscus, my advice would be to embrace the learning opportunities that come your way. The culture here fosters growth and innovation, making it a great place to work and learn.", "Screenshot": "screenshots/testimonial_5.png"},
{"Image": "https://hibiscus.services/home-asset/ashok.jpg", "Name": "Ashok Kumar", "Designation": "Quality Analyst", "Introduction": "At Hibiscus, my role as a Quality Analyst empowers me to make a meaningful impact on the quality and reliability of healthcare solutions in the US market. The aspect I cherish most about being part of Hibiscus is the culture of innovation and the continuous opportunities for professional growth and development. During my tenure at Hibiscus, I've honed my expertise in quality assurance frameworks, regulatory standards, and cross-functional collaboration, equipping me with invaluable skills for navigating the complexities of the US healthcare landscape. To those considering a career at Hibiscus, I recommend embracing a proactive mindset, seizing every chance to learn and adapt, and embracing the rewarding journey of contributing to transformative healthcare technologies.", "Screenshot": "screenshots/testimonial_6.png"},
{"Image": "https://hibiscus.services/home-asset/shiva.jpg", "Name": "Pitta Shiva", "Designation": "Quality Analyst", "Introduction": "As a Quality Analyst at Hibiscus, I play a crucial role in ensuring the high standards of our product in the US healthcare sector. What I enjoy most about working at Hibiscus is the collaborative environment and the opportunity to contribute to innovative solutions in the healthcare domain. Working at Hibiscus has enabled me to enhance my skills in quality assurance methodologies, data analysis, and regulatory compliance within the US healthcare industry. My advice to someone interested in joining Hibiscus would be to embrace a proactive approach, be open to learning, and actively engage with the dynamic challenges and opportunities in the healthcare technology space.", "Screenshot": "screenshots/testimonial_7.png"},
{"Image": "https://hibiscus.services/home-asset/vaibhav.jpg", "Name": "Vaibhav Saxena", "Designation": "Developer I", "Introduction": "Working at Hibiscus as a Developer I has been a great experience for my development as a programmer. Everyone there is friendly and always willing to help, which has made learning a lot easier.", "Screenshot": "screenshots/testimonial_8.png"}
]